{
    "key": [
        {
            "id": 1,
            "keys": "certifed"
        },
        {
            "id": 2,
            "keys": "archive"
        },
        {
            "id": 3,
            "keys": "community"
        }
    ],
    "personal": [
        {
            "firstName": "Ahmad Saiful",
            "lastName": "Huda",
            "city": "Jakarta",
            "introduce": "I graduated from Informatics Engineering and started my career as a network engineer. I have a strong interest and enthusiasm for the networking field. I have a strong basic knowledge of enterprise networking concepts and protocols, and have a passion for learning further and developing my skills in managing and designing efficient networks. ",
            "experience": 1,
            "email": {
                "primary": "saifulhuda020@gmail.com",
                "secondary": "19102158@ittelkom-pwt.ac.id",
                "subject": "Hiring",
                "massages": ""
            }
        }
    ],
    "socialMedia": [
        {
            "name": "LinkedIn",
            "icons": "fa6-brands:linkedin",
            "url": "https://www.linkedin.com/in/ipulhuda/"
        },
        {
            "name": "Instagram",
            "icons": "fa6-brands:instagram",
            "url": "https://www.instagram.com/_ipulhuda"
        },
        {
            "name": "Github",
            "icons": "fa6-brands:github",
            "url": "https://github.com/mon-adm0n"
        }
    ],
    "generalSkills": [
        {
            "icons": "bi:hdd-network-fill",
            "name": "Networking Engineer",
            "desc": "The training programs followed were LMS ID-Networks and Cisco Networking Academy which were carried out autodidactically"
        },
        {
            "icons": "bi:cloud-fill",
            "name": "Cloud Engineer",
            "desc": "The external training programs that were participated in were Microsoft's Cloud Intelligence and AWS ReStart Batch 7"
        }
    ],
    "softSkills": [
        {
            "img": "managementtime.png",
            "name": "Communication",
            "desc": ""
        },
        {
            "img": "teamwork.png",
            "name": "Team Work",
            "desc": ""
        },
        {
            "img": "problemsolving.png",
            "name": "Problem Solving",
            "desc": ""
        },
        {
            "img": "communication.png",
            "name": "Time Management",
            "desc": ""
        }
    ],
    "certifed": [
        {
            "id": 1,
            "img": "Network-AdministratorBNSP.png",
            "title": "Network Administrator. CNA",
            "desc": "The CNA certification measures the knowledge and skills of a network administrator in designing, configuring, managing, and maintaining an efficient and secure computer network. This certification aims to recognize the ability of a network administrator to effectively manage network infrastructure, optimize network performance, and safeguard information security.",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        },
        {
            "id": 2,
            "img": "Ahmad-Saiful-Huda-Jaringan-Dasar-Sertifikat-Jaringan-Komputer-Dasar-LMS-ID-Networkers-1.png",
            "title": "Network Basic",
            "desc": "The certification exam covers fundamental concepts of networking, types of networks, network models such as OSI, network hardware and software, and basic understanding of protocols and IP addresses. The Basic Computer Network Certificate aims to provide the foundational knowledge required for individuals to understand the fundamental principles in the world of computer networking.",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        },
        {
            "id": 3,
            "img": "Ahmad-Saiful-Huda-Cisco-Dasar-Sertifikat-Cisco-Dasar-LMS-ID-Networkers-1.png",
            "title": "Cisco Basic",
            "desc": "This certification covers fundamental topics in networking, including network concepts, network protocols, network hardware, subnetting, and network troubleshooting. Candidates are tested on their understanding of the basics of networking. It aims to measure the foundational knowledge of a professional in the field of computer networking. This is the first step in the broader Cisco certification pathway.",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        },
        {
            "id": 4,
            "img": "Ahmad-Saiful-Huda-Mikrotik-Dasar-Sertifikat-Mikrotik-Dasar-LMS-ID-Networkers-1.png",
            "title": "Mikrotik Basic",
            "desc": "LThe MikroTik Basic Certificate serves as a strong foundation for those who want to understand and work with MikroTik products. It can help validate fundamental knowledge and skills in network management using MikroTik devices.",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        },
        {
            "id": 5,
            "img": "PowerPlatformFundamentals-1.png",
            "title": "Power Platform Fundamentals",
            "desc": "The Power Platform Fundamentals certification aims to recognize individuals' understanding of the fundamentals of the Power Platform. This includes knowledge of core tools within the Power Platform, such as Power Apps (for building applications), Power Automate (for workflow automation), Power BI (for data analysis), and Power Virtual Agents (for creating conversational bots).",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        },
        {
            "id": 6,
            "img": "Cert3742024717-1.png",
            "title": "Azure Data Fundamentals",
            "desc": "The Azure Data Fundamentals certification, offered by Microsoft, is designed to measure foundational knowledge of technology and data services on the Azure platform. This certification helps individuals understand the basic concepts of data processing, data management, and data analysis using various services and tools available on Microsoft Azure.",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        },
        {
            "id": 7,
            "img": "Cert292232643267-1.png",
            "title": "Azure AI Fundamentals",
            "desc": "The Azure AI Fundamentals certification offered on the Certiport platform is a certification exam designed to assess an individual's knowledge and understanding of the fundamental concepts of artificial intelligence (AI) related to the services and solutions offered by Microsoft Azure. This certification aims to validate an individual's comprehension of the basic principles of AI and the utilization of AI services on the Azure platform. It also assists certification candidates in understanding how to utilize AI tools and technologies to address business challenges.",
            "url": "",
            "date": "20 Juni 2022",
            "dueDate": "20 Juni 2026"
        }
    ],
    "archive": [
        {
            "id": 1,
            "img": "HKI_HomeSweetHome.png",
            "title": "HKI",
            "desc": "Surat Pencatatan Ciptaan dari project Aplikasi Home Sweet Home: Let's Decorate dalam acara PKM-KC",
            "date": "20 Agustus 2022"
        },
        {
            "id": 2,
            "img": "Jurnal-MediaInformatika22.2.23.png",
            "title": "Jurnal",
            "desc": "Penelitian Tugas Akhir mengenai QOS Load balancing pada PFsense dan OPNsense, tersedia di: https://journal.likmi.ac.id/index.php/media-informatika/article/view/196/98",
            "date": "12 Agustus 2023"
        },
        {
            "id": 3,
            "img": "SertifikatPKM-1.png",
            "title": "PKM-KC",
            "desc": "Lolos Pendanaan dan melanjutkan PKP2",
            "date": "26 Juni 2022"
        },
        {
            "id": 4,
            "img": "19102158_AHMADSAIFULHUDA_Certificate-1.png",
            "title": "Program Kampus Merderka Intelligence Cloud",
            "desc": "Program yang diselenggarakan oleh Kemenbud atau disebut yang biasa Kampus Merdeka menyediakan banyak bidang, salah satunya yaitu Intelligence Cloud dengan mitra PT. Mari Belajar Indonesia Cerdas yang berkolaborasi dengan Microsoft.",
            "date": "26 Januari 2022"
        },
        {
            "id": 5,
            "img": "skripsi.png",
            "title": "Archive Tugas Akhir",
            "desc": "Tugas Akhir dengan judul: Analisis Perbandingan QOS pada PFsense dan OPNsense menggunakan Metode Load Balancing",
            "date": "26 Agustus 2023"
        }
    ],
    "community": [
        {
            "id": 1,
            "img": "mbkm.png",
            "title": "Intelligence Cloud Track",
            "desc": "Diselenggarakan oleh PT. Mari Belajar Indonesia Cerdas, dengan fokus pembahsan Azure Cloud Fundamentals",
            "date": "20 Agustus 2022"
        },
        {
            "id": 2,
            "img": "HKI_HomeSweetHome.png",
            "title": "AWS ReStart Batch 7",
            "desc": "Diselanggarakan oleh PT. Orbit Ventura Indonesia, dengan fokus pembahsan AWS Fundamentals",
            "date": "12 September 2023"
        }
    ],
    "project": [

        {
            "id": 1,
            "img": "Lab-pkt1.png",
            "url": "https://drive.google.com/drive/folders/1qK5fmdSoe_BQh04wTL86fOA194ooMOEw?usp=sharing",
            "title": "Lab 3-Tier Network Enterprise",
            "desc": "Lab ini dirancang untuk memberikan pemahaman mengenai Network Enterprise 3-Tier, menggunakan switch L2/L3 dengan menerapkan LACP, routing OSPF, VLAN, Switching, DHCP Server, DNS Server.",
            "date": "20 April 2024"
        },
        {
            "id": 2,
            "img": "Lab-FortiAP.png",
            "url": "https://onedrive.live.com/view.aspx?resid=F0E588C4255E25E9%2110359&id=documents&wd=target%28NETWORKING.one%7CA7D2600C-3043-4141-B567-B27254A355E6%2FFortiGate%20-WLC%7C57AF4482-AD99-478F-9DA7-4ABA31D002E3%2F%29onenote:https://d.docs.live.net/f0e588c4255e25e9/Networking/NETWORKING.one#FortiGate%20-WLC&section-id={A7D2600C-3043-4141-B567-B27254A355E6}&page-id={57AF4482-AD99-478F-9DA7-4ABA31D002E3}&end",
            "title": "Lab 2-Tier FortiAP",
            "desc": "Lab ini dirancang untuk memberikan pemahaman mengenai Network Enterprise 2-Tier, menggunakan switch cisco 9200, Fortiswitch 101E dan FortiAP. Bertujuan untuk implementasi sebuah project sesungguhnya dimana menerapkan 2 SSID menggunakan vlan yang berbeda untuk tagging ke FortiAP",
            "date": "20 November 2023"
        },
        {
            "id": 3,
            "img": "Lab-SDWAN-Fundamental.png",
            "url": "https://drive.google.com/drive/folders/1qK5fmdSoe_BQh04wTL86fOA194ooMOEw?usp=sharing",
            "title": "Lab SDWAN-IPsec Fundamentals",
            "desc": "Lab ini dirancang untuk memberikan pemahaman mendalam tentang implementasi dan konfigurasi SD-WAN, IPsec, menggunakan routing static. Topologi jaringan dalam lab ini melibatkan empat kantor cabang yang terhubung melalui jaringan internet publik dengan menggunakan tunnel IPsec untuk keamanan dan BGP untuk routing dinamis. SD-WAN akan digunakan untuk mengoptimalkan jalur pengiriman data antara kantor cabang dan kantor pusat.",
            "date": "20 Juni 2024"
        },
        {
            "id": 4,
            "img": "HA-Fortigate.png",
            "url": "https://drive.google.com/",
            "title": "Lab Test Swing HA (Active-Pasive) Fortigate ",
            "desc": "Lab ini dirancang untuk memberikan pemahaman mendalam tentang implementasi dan konfigurasi High Availbility Fortigate.",
            "date": "27 Juni 2024"
        },
        {
            "id": 5,
            "img": "Lab-FTNT-SDWAN.png",
            "url": "https://drive.google.com/",
            "title": "Lab SDWAN-IPsec and BGP Fundamentals",
            "desc": "Lab ini dirancang untuk memberikan pemahaman mendalam tentang implementasi dan konfigurasi SD-WAN, IPsec, dan BGP menggunakan MikroTik RouterOS 7 dan FortiGate 7.0.11. Topologi jaringan dalam lab ini melibatkan empat kantor cabang yang terhubung melalui jaringan internet publik dengan menggunakan tunnel IPsec untuk keamanan dan BGP untuk routing dinamis. SD-WAN akan digunakan untuk mengoptimalkan jalur pengiriman data antara kantor cabang dan kantor pusat.",
            "date": "25 Juni 2024"
        },    
        {
            "id": 6,
            "img": "Lab-glsb.png",
            "url": "",
            "title": "Lab GLSB FortiADC",
            "desc": "Lab ini dirancang untuk memberikan pemahaman mengenai Load Balancer FortiADC, menggunakan FortiADC VM, Fortigate VM dan Ubuntu (Webserver). Bertujuan untuk implementasi sebuah project sesungguhnya dimana menggunakan 2 server backend",
            "date": "20 Maret 2024"
        },
        {
            "id": 7,
            "img": "sharing-harden.png",
            "url": "https://www.canva.com/design/DAGK7fPZMhY/SH6C-x_Vt273UHuicu14Hg/view?utm_content=DAGK7fPZMhY&utm_campaign=designshare&utm_medium=link&utm_source=editor",
            "title": "Sharing Knowledge Hardening Policy Fortigate Basic",
            "desc": "Materi mengenai langkah-langkah hardening policy pada Fortigate untuk pemula, diperuntukan untuk user/engineer baru dalam rangka handover.",
            "date": "14 Juli 2024"
        },
        {
            "id": 8,
            "img": "automation/remote-ssh.png",
            "url": "",
            "title": "Automation Scraping Inventory Via Remote SSH",
            "desc": "Program sederhana menggunakan python untuk scraping data seperti inventory, log, seluruh command system agar mempermudah dalam mendapatkan data pada banyak perangkat dengan 1 perintah. Membantu juga dalam pelaporan Preventive Maintenance",
            "date": "10 Juli 2024"
        }, 
        {
            "id": 9,
            "img": "automation/interface-cisco.png",
            "url": "",
            "title": "Generator Report Cisco Interface to Excel",
            "desc": "Program sederhana menggunakan python untuk scraping data interface cisco dan diconvert kedalam file Excel",
            "date": "02 Juli 2024"
        },
        {
            "id": 10,
            "img": "automation/report-pm.png",
            "url": "",
            "title": "Generator Report Inventory to Docx",
            "desc": "Program sederhana menggunakan python untuk scraping data Inventori, Log, Backup config dan diconvert ke docx sebagai report. Membantu dan mempercepat dalam pelaporan Preventive Maintenance",
            "date": "10 Maret 2024"
        },
        {
            "id": 11,
            "img": "mobile.io.png",
            "url": "https://repository.ittelkom-pwt.ac.id/7840/",
            "title": "Penerapan Microsoft Azure Pada Aplikasi Mobil.io Untuk Prediksi Harga Mobil",
            "desc": "This growth in public interest has encouraged an increase in the car sales business with a competitive market. Every car sales showroom tries to increase their sales so that they are able to exist and compete with other competitors. One of the ways to attract buyers is by providing advertisements through digital media. Viewed from the customer's point of view, the provision of advertising by market players also presents its own problem, namely too much information on offers circulating. This will make it difficult for customers to decide on a suitable car. Instead of receiving random product offers, customers can be provided with personalized offers or recommendations. Personalization of car recommendations can be done by utilizing some data from the profile of prospective buyers, such as age, gender, and income. Through machine learning modeling, these variables can be used as predictor variables to be able to predict cars with relevant prices to offer. This project aims to build a mobile-based application that presents personalized cars based on the predictions of machine learning models. The application that is built is expected to be a solution that makes it easier for prospective buyers to choose a car.",
            "date": "20 Agustus 2022"
        },
        {
            "id": 12,
            "img": "HKI_HomeSweetHome.png",
            "url": "https://drive.google.com/drive/folders/1WElcgBpNQBa5dXAow__D9iMPmcKL-npp?usp=sharing",
            "title": "Aplikasi Home Sweet Home: Let's Decored",
            "desc": "Project PKM 2022 menggunakan sistem Augmented Reality yang dibangun menggunakan Unity dan assets-assets modeling 3D yang dapat divisualisasikan secara langsung melalui smartphone dengan menggunakan camera belakang smartphone itu sendiri. sehingga objek terlihat nyata.",
            "date": "12 November 2022"
        }
    ]
}